[Timeout] BooleanLiteral
src/components/command-menu.tsx:22:42
 }
 
 export const CommandMenu = ({ links }: Props) => {
-  const [open, setOpen] = React.useState(false);
+  const [open, setOpen] = React.useState(true);
 
   React.useEffect(() => {

[Killed] BlockStatement
src/components/command-menu.tsx:24:25
 export const CommandMenu = ({ links }: Props) => {
   const [open, setOpen] = React.useState(false);
 
-  React.useEffect(() => {
-    const down = (e: KeyboardEvent) => {
-      if (e.key === "j" && (e.metaKey || e.ctrlKey)) {
-        e.preventDefault();
-        setOpen((open) => !open);
-      }
-    };
-
-    document.addEventListener("keydown", down);
-    return () => document.removeEventListener("keydown", down);
-  }, []);
+  React.useEffect(() => {}, []);
 
   return (
killedBy: CommandMenu Keyboard shortcut opens dialog on Ctrl+J
statusReason: Error: Unable to find an element with the placeholder text of: Type a command or search...

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <p

[Killed] BlockStatement
src/components/command-menu.tsx:25:40
   const [open, setOpen] = React.useState(false);
 
   React.useEffect(() => {
-    const down = (e: KeyboardEvent) => {
-      if (e.key === "j" && (e.metaKey || e.ctrlKey)) {
-        e.preventDefault();
-        setOpen((open) => !open);
-      }
-    };
+    const down = (e: KeyboardEvent) => {};
 
     document.addEventListener("keydown", down);
killedBy: CommandMenu Keyboard shortcut opens dialog on Ctrl+J
statusReason: Error: Unable to find an element with the placeholder text of: Type a command or search...

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <p

[Killed] LogicalOperator
src/components/command-menu.tsx:26:29
 
   React.useEffect(() => {
     const down = (e: KeyboardEvent) => {
-      if (e.key === "j" && (e.metaKey || e.ctrlKey)) {
+      if (e.key === "j" && (e.metaKey && e.ctrlKey)) {
         e.preventDefault();
         setOpen((open) => !open);
killedBy: CommandMenu Keyboard shortcut opens dialog on Ctrl+J
statusReason: Error: Unable to find an element with the placeholder text of: Type a command or search...

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <p

[Killed] BlockStatement
src/components/command-menu.tsx:26:54
 
   React.useEffect(() => {
     const down = (e: KeyboardEvent) => {
-      if (e.key === "j" && (e.metaKey || e.ctrlKey)) {
-        e.preventDefault();
-        setOpen((open) => !open);
-      }
+      if (e.key === "j" && (e.metaKey || e.ctrlKey)) {}
     };
 
killedBy: CommandMenu Keyboard shortcut opens dialog on Ctrl+J
statusReason: Error: Unable to find an element with the placeholder text of: Type a command or search...

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <p

[Killed] ArrowFunction
src/components/command-menu.tsx:28:17
     const down = (e: KeyboardEvent) => {
       if (e.key === "j" && (e.metaKey || e.ctrlKey)) {
         e.preventDefault();
-        setOpen((open) => !open);
+        setOpen(() => undefined);
       }
     };
killedBy: CommandMenu Keyboard shortcut opens dialog on Ctrl+J
statusReason: Error: Unable to find an element with the placeholder text of: Type a command or search...

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <p

[Killed] BooleanLiteral
src/components/command-menu.tsx:28:27
     const down = (e: KeyboardEvent) => {
       if (e.key === "j" && (e.metaKey || e.ctrlKey)) {
         e.preventDefault();
-        setOpen((open) => !open);
+        setOpen((open) => open);
       }
     };
killedBy: CommandMenu Keyboard shortcut opens dialog on Ctrl+J
statusReason: Error: Unable to find an element with the placeholder text of: Type a command or search...

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <p

[Survived] ArrowFunction
src/components/command-menu.tsx:33:12
     };
 
     document.addEventListener("keydown", down);
-    return () => document.removeEventListener("keydown", down);
+    return () => undefined;
   }, []);
 

[Survived] ArrayDeclaration
src/components/command-menu.tsx:34:6
 
     document.addEventListener("keydown", down);
     return () => document.removeEventListener("keydown", down);
-  }, []);
+  }, ["Stryker was here"]);
 
   return (

[Killed] BooleanLiteral
src/components/command-menu.tsx:46:42
         to open the command menu
       </p>
       <Button
-        onClick={() => setOpen((open) => !open)}
+        onClick={() => setOpen((open) => open)}
         variant="outline"
         size="icon"
killedBy: CommandMenu Dialog interaction opens command dialog when button is clicked
statusReason: Error: Unable to find an element with the placeholder text of: Type a command or search...

Ignored nodes: comments, script, style
<body>
  <div>
    <p
      class="fixed bottom-0 left-0 right-0 hidden border-t border-t-muted bg-white p-1 text-center text-sm text-muted-foreground print:hidden xl:block"
    >

[Killed] ArrowFunction
src/components/command-menu.tsx:46:32
         to open the command menu
       </p>
       <Button
-        onClick={() => setOpen((open) => !open)}
+        onClick={() => setOpen(() => undefined)}
         variant="outline"
         size="icon"
killedBy: CommandMenu Dialog interaction opens command dialog when button is clicked
statusReason: Error: Unable to find an element with the placeholder text of: Type a command or search...

Ignored nodes: comments, script, style
<body>
  <div>
    <p
      class="fixed bottom-0 left-0 right-0 hidden border-t border-t-muted bg-white p-1 text-center text-sm text-muted-foreground print:hidden xl:block"
    >

[Killed] BlockStatement
src/components/command-menu.tsx:59:31
           <CommandEmpty>No results found.</CommandEmpty>
           <CommandGroup heading="Actions">
             <CommandItem
-              onSelect={() => {
-                setOpen(false);
-                window.print();
-              }}
+              onSelect={() => {}}
             >
               <span>Print</span>
killedBy: CommandMenu Actions calls window.print when Print is selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] BooleanLiteral
src/components/command-menu.tsx:60:25
           <CommandGroup heading="Actions">
             <CommandItem
               onSelect={() => {
-                setOpen(false);
+                setOpen(true);
                 window.print();
               }}

[Killed] ArrowFunction
src/components/command-menu.tsx:68:24
             </CommandItem>
           </CommandGroup>
           <CommandGroup heading="Links">
-            {links.map(({ url, title }) => (
-              <CommandItem
-                key={url}
-                onSelect={() => {
-                  setOpen(false);
-                  window.open(url, "_blank");
-                }}
-              >
-                <span>{title}</span>
-              </CommandItem>
-            ))}
+            {links.map(() => undefined)}
           </CommandGroup>
           <CommandSeparator />
killedBy: CommandMenu Dialog interaction renders all provided links in the dialog
statusReason: Error: Unable to find an element with the text: GitHub. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  data-scroll-locked="1"
  style="pointer-events: none;"
>
  <span

[Killed] BlockStatement
src/components/command-menu.tsx:71:33
             {links.map(({ url, title }) => (
               <CommandItem
                 key={url}
-                onSelect={() => {
-                  setOpen(false);
-                  window.open(url, "_blank");
-                }}
+                onSelect={() => {}}
               >
                 <span>{title}</span>
killedBy: CommandMenu Actions calls window.open with correct URL when a link is selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://github.com/Defused15", "_blank"

Number of calls: 0
