[Killed] ArrowFunction
src/components/darkmode.tsx:28:36
         </Button>
       </DropdownMenuTrigger>
       <DropdownMenuContent align="end">
-        <DropdownMenuItem onClick={() => setTheme("light")}>
+        <DropdownMenuItem onClick={() => undefined}>
           Light
         </DropdownMenuItem>
killedBy: ModeToggle Dropdown interaction calls setTheme with 'light' when Light is selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
src/components/darkmode.tsx:31:36
         <DropdownMenuItem onClick={() => setTheme("light")}>
           Light
         </DropdownMenuItem>
-        <DropdownMenuItem onClick={() => setTheme("dark")}>
+        <DropdownMenuItem onClick={() => undefined}>
           Dark
         </DropdownMenuItem>
killedBy: ModeToggle Dropdown interaction calls setTheme with 'dark' when Dark is selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
src/components/darkmode.tsx:34:36
         <DropdownMenuItem onClick={() => setTheme("dark")}>
           Dark
         </DropdownMenuItem>
-        <DropdownMenuItem onClick={() => setTheme("system")}>
+        <DropdownMenuItem onClick={() => undefined}>
           System
         </DropdownMenuItem>
killedBy: ModeToggle Dropdown interaction calls setTheme with 'system' when System is selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
