[Killed] BlockStatement
src/components/project-card.tsx:19:38
   githubLink?: string;
 }
 
-function getCleanLink(link?: string) {
-  if (!link) return "";
-  return link.replace(/^https?:\/\//i, "").replace(/^www\./i, "");
-}
+function getCleanLink(link?: string) {}
 
 export function ProjectCard({ title, description, tags, link, githubLink }: Props) {
killedBy: ProjectCard Link behavior renders cleaned link text in small div
statusReason: TestingLibraryElementError: Unable to find an element with the text: (content, element)=>{ return element?.tagName === "DIV" && content.replace(/\s+/g, "") === "defused15.github.io/QA-Playground-Tests/dashboard.html".replace(/\s+/g, ""); } (normalized from '(content, element)=>{
                return element?.tagName === "DIV" && content.replace(/\s+/g, "") === "defused15.github.io/QA-Playground-

[Killed] ConditionalExpression
src/components/project-card.tsx:20:7
 }
 
 function getCleanLink(link?: string) {
-  if (!link) return "";
+  if (true) return "";
   return link.replace(/^https?:\/\//i, "").replace(/^www\./i, "");
 }
killedBy: ProjectCard Link behavior renders cleaned link text in small div
statusReason: TestingLibraryElementError: Unable to find an element with the text: (content, element)=>{ return element?.tagName === "DIV" && content.replace(/\s+/g, "") === "defused15.github.io/QA-Playground-Tests/dashboard.html".replace(/\s+/g, ""); } (normalized from '(content, element)=>{
                return element?.tagName === "DIV" && content.replace(/\s+/g, "") === "defused15.github.io/QA-Playground-

[Killed] ConditionalExpression
src/components/project-card.tsx:20:7
 }
 
 function getCleanLink(link?: string) {
-  if (!link) return "";
+  if (false) return "";
   return link.replace(/^https?:\/\//i, "").replace(/^www\./i, "");
 }
killedBy: ProjectCard Rendering renders title, description and tags correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Survived] Regex
src/components/project-card.tsx:21:52
 
 function getCleanLink(link?: string) {
   if (!link) return "";
-  return link.replace(/^https?:\/\//i, "").replace(/^www\./i, "");
+  return link.replace(/^https?:\/\//i, "").replace(/www\./i, "");
 }
 

[Killed] ConditionalExpression
src/components/project-card.tsx:43:16
               ) : (
                 title
               )}
-              {githubLink && (
-                <a
-                  href={githubLink}
-                  target="_blank"
-                  rel="noopener noreferrer"
-                  className="inline-flex items-center gap-1 text-xs font-normal text-muted-foreground hover:text-foreground transition-colors"
-                >
-                  <GitHubIcon className="size-3" />
-                  <span>GitHub repo</span>
-                </a>
-              )}
+              {false}
             </div>
           </CardTitle>
killedBy: ProjectCard Link behavior renders GitHub repo link with label text when githubLink is provided
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "link" and name `/github repo/i`

Here are the accessible roles:

  heading:

  Name "QA Playground Test Automation":
  <h3

[Killed] ConditionalExpression
src/components/project-card.tsx:43:16
               ) : (
                 title
               )}
-              {githubLink && (
-                <a
-                  href={githubLink}
-                  target="_blank"
-                  rel="noopener noreferrer"
-                  className="inline-flex items-center gap-1 text-xs font-normal text-muted-foreground hover:text-foreground transition-colors"
-                >
-                  <GitHubIcon className="size-3" />
-                  <span>GitHub repo</span>
-                </a>
-              )}
+              {true}
             </div>
           </CardTitle>
killedBy: ProjectCard Link behavior renders GitHub repo link with label text when githubLink is provided
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "link" and name `/github repo/i`

Here are the accessible roles:

  heading:

  Name "QA Playground Test Automation":
  <h3

[Killed] ArrowFunction
src/components/project-card.tsx:69:21
 
       <CardContent className="mt-auto flex">
         <div className="mt-2 flex flex-wrap gap-1">
-          {tags.map((tag) => (
-            <Badge
-              className="px-1 py-0 text-[10px] print:px-1 print:py-0.5 print:text-[8px] print:leading-tight"
-              variant="secondary"
-              key={tag}
-            >
-              {tag}
-            </Badge>
-          ))}
+          {tags.map(() => undefined)}
         </div>
       </CardContent>
killedBy: ProjectCard Rendering renders title, description and tags correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Playwright. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="rounded-lg dark:bg-gray-900 bg-card text-card-foreground flex flex-col overfl
